import os

def t1():
    """
    Создайте программу возвращающую информацию о системе вида:
    Операционная система - ХХХ
    Имя компьютера - ХХХ
    Имя пользователя - ХХХ
    """


def t2(dir: str, num: int):
    """
    Создайте программу создающую папку dir внутри которой еще num папок,
    имена которых цифры от 1 до num
    """


def t3(dir: str, name: str):
    """
    Напишите программу-вирус, которая переименовывает папки c четными номерами 
    в ранее созданной папке dir, новые имена должны начинаться со строки name.
    """


def t4(dir: str, text: str):
    """
    Напишите программу которая создает папку dir и записывает 
    текст text в файл answer.txt
    """